In [2]:
import pandas as pd
import numpy as np
import matplotlib as ply
import sklearn

In [5]:
#importing the dataset
data=pd.read_table("http://bit.ly/movieusers")
data.head(2)

C:\ANACONDA\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.

  1|24|M|technician|85711
0      2|53|F|other|94043
1     3|23|M|writer|32067

In [4]:
data=pd.read_table("http://bit.ly/movieusers",sep="|")
data.head(2)

C:\ANACONDA\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   1  24  M technician  85711
0  2  53  F      other  94043
1  3  23  M     writer  32067

In [6]:
data=pd.read_table("http://bit.ly/movieusers",sep="|",header=None)
data.head(2)

C:\ANACONDA\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043

## HANDLING MISSING VALUES

In [17]:
df = pd.read_csv("https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv",parse_dates=['day'])
df

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02       -99999          7  Sunny
2 2017-01-03           28     -99999   Snow
3 2017-01-04       -99999          7      0
4 2017-01-05           32     -99999   Rain
5 2017-01-06           31          2  Sunny
6 2017-01-06           34          5      0

In [10]:
df.day.dtype

dtype('O')

In [11]:
type(df.day[0])

str

In [8]:
df['temperature'].value_counts()    #similar to mode--->returns frequency of column values

-99999    2
 32       2
 31       1
 28       1
 34       1
Name: temperature, dtype: int64

In [13]:
df[df.duplicated()]

Empty DataFrame
Columns: [day, temperature, windspeed, event]
Index: []

In [14]:
df['temperature'].duplicated()       #returns whether value is duplicated or not

0    False
1    False
2    False
3     True
4     True
5    False
6    False
Name: temperature, dtype: bool

In [15]:
df[df['temperature'].duplicated()]    #checking for specific column

        day  temperature  windspeed event
3  1/4/2017       -99999          7     0
4  1/5/2017           32     -99999  Rain

In [16]:
df[df['event'].duplicated()]

        day  temperature  windspeed  event
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [18]:
type(df.day[0])    #checking data type of day column

pandas._libs.tslibs.timestamps.Timestamp

In [33]:
new_df=df.replace({'temperature':-99999,'windspeed':-99999,'event':'0'}, np.nan)
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0    NaN
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

# IMPUTATION : used to substitute missing values

In [45]:
new_df.isnull().sum()

day            0
temperature    2
windspeed      2
event          2
dtype: int64

In [34]:
data=new_df.fillna(0)
data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          0.0        7.0  Sunny
2 2017-01-03         28.0        0.0   Snow
3 2017-01-04          0.0        7.0      0
4 2017-01-05         32.0        0.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

In [35]:
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0    NaN
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [36]:
new_df.fillna(method='ffill')

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        7.0   Snow
3 2017-01-04         28.0        7.0   Snow
4 2017-01-05         32.0        7.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0  Sunny

In [40]:
f_data = new_df.fillna(method='ffill')
f_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        7.0   Snow
3 2017-01-04         28.0        7.0   Snow
4 2017-01-05         32.0        7.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0  Sunny

In [46]:
##bfill--->backfill
b_data = new_df.fillna(method='bfill')
b_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         28.0        7.0  Sunny
2 2017-01-03         28.0        7.0   Snow
3 2017-01-04         32.0        7.0   Rain
4 2017-01-05         32.0        2.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [ ]:
#mean and median imputations work only on numerical values

In [42]:
#mean imputation-->filling missing values with corresponding mean of the column
new_df.mean()

temperature    31.4
windspeed       5.4
dtype: float64

In [44]:
mean_data = new_df.fillna(new_df.mean())
mean_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         31.4        7.0  Sunny
2 2017-01-03         28.0        5.4   Snow
3 2017-01-04         31.4        7.0    NaN
4 2017-01-05         32.0        5.4   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [47]:
#median imputation
new_df.median()

temperature    32.0
windspeed       6.0
dtype: float64

In [49]:
median_data=new_df.fillna(new_df.median())
median_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        6.0   Snow
3 2017-01-04         32.0        7.0    NaN
4 2017-01-05         32.0        6.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [51]:
#missing values in text column
new_df.event.mode()

0     Rain
1    Sunny
dtype: object

In [57]:
new_df['event'] = new_df['event'].fillna(new_df.event.mode().iloc[0])  #we use iloc[0] to replace with rain..since we have 2 modes
new_df                                                                  #we can use iloc[1] to replace with sunny

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0   Rain
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0   Rain